import clay from '../../assets/imgs/pots/clay.jpg';
import plastic from '../../assets/imgs/pots/plastic.jpg';
import ceramic from '../../assets/imgs/pots/ceramic.jpg';
import terracotta from '../../assets/imgs/pots/terracotta.jpg';

import { potsTitles } from '../../data/app.titles';

export function Pots() {

    const potsData = [
        {
            imgSrc: clay,
            title: 'חרס',
            description: 'עציצי חרס הם אחת הבחירות הפופולריות ביותר לגידול צמחים, והם מציעים מספר יתרונות חשובים. חרס הוא חומר טבעי, שמאפשר למים ולחמצן לזרום בקלות אל שורשי הצמח, דבר התורם לבריאותם ולצמיחה תקינה. בנוסף, הם מעניקים למראה הצמח אסתטיקה טבעית ומרשימה, ומגיעים במגוון עיצובים וצבעים שמתאימים לכל סגנון עיצוב.'
        },
        {
            imgSrc: plastic,
            title: 'פלסטיק',
            description: 'עציצי פלסטיק מציעים מספר יתרונות שמייחדים אותם על פני חומרים אחרים. אחד היתרונות המרכזיים של פלסטיק הוא שהוא קל מאוד, מה שמאפשר להעביר את העציץ בקלות ממקום למקום ללא מאמץ. בנוסף, עציצי פלסטיק עמידים בפני תנאי מזג אוויר קיצוניים ואינם נשברים כמו חרס, מה שהופך אותם לבחירה אידיאלית לשימוש חוץ, במיוחד באזורים עם רוח או גשם. הם גם שומרים על לחות האדמה בצורה טובה, ומסייעים במניעת התייבשות מהירה, אך יש לזכור שצריך לוודא שיש ניקוז טוב כדי למנוע רטיבות מיותרת. יתרון נוסף הוא המחיר הנמוך יחסית, מה שהופך את עציצי הפלסטיק לנגישים ומבוקשים. בנוסף, עציצי פלסטיק מגיעים במגוון צבעים, גדלים ועיצובים, כך שניתן למצוא את העציץ המתאים ביותר לכל סגנון.'
        },
        {
            imgSrc: ceramic,
            title: 'קרמיקה',
            description: 'עציצי קרמיקה מציעים יתרונות רבים שמייחדים אותם בפני חומרים אחרים. הקרמיקה שומרת על יציבות טמפרטורה, מה שעוזר לשמור על תנאים מיטביים לצמחים בתנאים חמים או קרים. בנוסף, הם בעלי מראה טבעי ואלגנטי שמוסיף עיצוב ויופי לכל חלל, בין אם בבית ובין אם בגינה. עציצי קרמיקה גם מסייעים בשמירה על לחות האדמה ומפחיתים את הצורך בהשקיה תכופה. למרות שמדובר בחומר כבד יותר, עמידותו לאורך זמן והיכולת לשמור על צורתו הופכים אותו לבחירה מצוינת לצמחים ארוכי טווח. הם מגיעים במגוון צבעים ודגמים, ומתאימים לכל סגנון עיצוב.'
        },
        {
            imgSrc: terracotta,
            title: 'טרקוטה',
            description: 'עציצי טרקוטה הם בחירה פופולרית בזכות יתרונותיהם הרבים. הטרקוטה מאפשרת לאוויר ולמים לזרום בקלות אל שורשי הצמח, דבר שמסייע בשמירה על מערכת שורשים בריאה. בנוסף, צבעה החמים והטבעי של הטרקוטה מעניק מראה אותנטי ומרשים, המוסיף עיצוב ייחודי לכל סביבה. עציצי טרקוטה עמידים בפני תנאי מזג אוויר קשים, ומספקים יציבות לטמפרטורה, מה שמסייע לצמחים להישאר במצב בריא לאורך זמן.'
        }
    ]

    return (
        <>
            <section dir="rtl" className="pots">
                <h1>{potsTitles.title}</h1>
                <p>{potsTitles.subTitle}</p>
                <section className="pots-type-list">
                    {potsData.map((pot, index) => (
                        <div className="pots-type" key={index}>
                            <img src={pot.imgSrc} alt={pot.title} />
                            <section>
                                <h2>{pot.title}</h2>
                                <p>{pot.description}</p>
                            </section>
                        </div>
                    ))}
                </section>
            </section>
        </>
    )
}
