export function About() {
    return <section className="about" id="about" dir="rtl">
        <p>גינת תמר היא משתלה ירושלמית ותיקה שפועלת כבר מעל ארבעה עשורים. ממוקמת בדרך בית לחם, ליד מתחם התחנה.</p>
        <p>במשך כל השנים שמרנו על אווירה מזמינה, בה כל לקוח מרגיש בבית וכל צמח מקבל את היחס הראוי לו.</p>
        <p>אנו מאמינים שגידול צמחים הוא לא רק עבודה – זו תשוקה. כל צמח שמגיע אלינו זוכה להשקעה רבה, טיפול אישי ומקצועי. כל אחד מהצמחים שלנו, בין אם מדובר בצמחי נוי, צמחים פנימיים, צמחים לסביבה החיצונית או עצי פרי, מקבל יחס מדויק ומותאם לצרכים שלו.</p>
        <p>הצוות שלנו, שמורכב מאנשים שמבינים ואוהבים צמחים, מקדיש זמן להקשיב ולהיענות לכל שאלה שלכם. אנחנו כאן לא רק כדי למכור לכם צמח, אלא גם כדי לעזור לכם לבחור את הצמח שמתאים לכם ביותר ולהדריך אתכם כיצד לטפלו בו בצורה הטובה ביותר.</p>
        <p>גינת תמר היא לא רק משתלה – זהו מקום שבו כל צמח זוכה לאהבה ולדאגה. אנחנו מזמינים אתכם לבוא ולהיות חלק מהמשפחה שלנו. תיהנו מהשירות האדיב והאווירה הביתית, ותמצאו את הצמחים שיהפכו את הבית או הגינה שלכם לירוקים, פורחים ומיוחדים.</p>

    </section>
}
