export {
    flowers,
    indoor,
    succulents,
    herbsTitles,
    potsTitles,
    ctgTitles,
    crystalsTitles,
    galleryTitles
}


// Ctg Pages

const flowers = {
    title: "פורחים",
    subTitle: "אלו רק דוגמאות בודדות מהמבחר הרחב של הפרחים שיש למשתלה להציע. אם מצאתם משהו באתר שאתם אוהבים, אל תהססו להראות לנו, ואם לא נמצא בדיוק את הצמח שחיפשתם, אנחנו תמיד כאן כדי להמליץ לכם על משהו דומה!"
}

const indoor = {
    title: "צמחי בית",
    subTitle: "אלו רק דוגמאות בודדות מהמבחר הרחב של צמחי הבית שיש למשתלה להציע. אם מצאתם משהו באתר שאתם אוהבים, אל תהססו להראות לנו, ואם לא נמצא בדיוק את הצמח שחיפשתם, אנחנו תמיד כאן כדי להמליץ לכם על משהו דומה!"
}

const succulents = {
    title: "קקטוסים וסוקולנטים",
    subTitle: "אלו רק דוגמאות בודדות מהמבחר הרחב של הקקטוסים והסוקולנטים שיש למשתלה להציע. אם מצאתם משהו באתר שאתם אוהבים, אל תהססו להראות לנו, ואם לא נמצא בדיוק את הצמח שחיפשתם, אנחנו תמיד כאן כדי להמליץ לכם על משהו דומה!"
}

const herbsTitles = {
    title: "תבלינים",
    subTitle: "אלו רק דוגמאות בודדות מהמבחר הרחב של התבלינים שיש למשתלה להציע. אם מצאתם משהו באתר שאתם אוהבים, אל תהססו להראות לנו, ואם לא נמצא בדיוק את הצמח שחיפשתם, אנחנו תמיד כאן כדי להמליץ לכם על משהו דומה!",
    disclaimer: "מלאי התבלינים במשתלה משתנה לפי עונות ואספקה."
}

const potsTitles = {
    title: "עציצים",
    subTitle: "במשתלה שלנו תמצאו מבחר רחב של עציצים במגוון צורות, גדלים וחומרים שונים. כל סוג של עציץ מציע יתרונות ייחודיים שמתאימים לצרכים שונים, בין אם אתם מחפשים עציץ דקורטיבי, פונקציונלי או כזה שמתאים לסוג צמח מסוים. אנו דואגים להביא לכם את כל האפשרויות, כך שתוכלו למצוא את העציץ המושלם.",
}

const crystalsTitles = {
    title: "קריסטלים",
    subTitle: "במשתלה שלנו תוכלו למצוא אוסף מיוחד של קריסטלים טבעיים. כל קריסטל מביא עמו אנרגיה חיובית ויופי טבעי שיכול להעשיר את הבית או הגינה. אצלנו תמצאו קריסטלים שמתאימים לאוהבי הרוחניות, למי שמחפש פתרונות להארה אישית או פשוט לאוהבי יופי טבעי. הקריסטלים שלנו מגיעים בגדלים שונים וכוללים אבני חן עם סגולות ריפוי, ויזואליות מרהיבה ומגע קסום. אנו מזמינים אתכם לבוא ולהתרשם מהמבחר שלנו ולהתנסות באנרגיות המיוחדות של כל קריסטל.",
    disclaimer: "מלאי הקריסטלים במשתלה משתנה לפי אספקה.",
}

const galleryTitles = {
    title: "קצת תמונות מהמשתלה שלנו",
    subTitle: "הצמחים בתמונות צולמו בתקופות שונות ולכן לא תמיד כל הצמחים יהיו זמינים במלאי. עם זאת, תמיד ניתן למצוא תחליפים איכותיים."
}

// Ctg cmp

const ctgTitles = {
    title: "מהמבחר של המשתלה",
    subTitle: "זוהי רק טעימה קטנה מתוך המגוון הרחב והעשיר שיש למשתלה להציע. במשתלה שלנו תמצאו אינספור צמחים מסוגים שונים, עציצים מעוצבים, תבלינים, פרחים ייחודיים, סוקולנטים, קקטוסים, עצים גדולים ומגוון פתרונות ירוקים לבית ולגינה. אנו מזמינים אתכם לבוא ולהתרשם מהמבחר הגדול שלנו שממשיך להתחדש כל הזמן.",
    disclaimer: "מלאי הצמחים במשתלה משתנה לפי עונות ואספקה."
}
